# data-database-types-relational-language-SQL-MySQL-C_R_UD-read-command-SELECT-WHERE-operator-LIKE
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **search for a **specified** **pattern** in a **string** [1]

- **partially** **match** a **string** **or** **subset** of a string [1]

- **clause** - **WHERE** - **search** for **specified** **pattern** in a **column** - attribute - field - **operator** - **LIKE** [1]

- **percentage** **character** - % - **represents** **zero** **or** **more** **characters** [1]

```sql
mysql> use lab1;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab1 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

- returned rows - records - tuples - from columns - attributes - fields - name - age - clause - WHERE - spelling of column - attribute - field - name - has the letter - "a" - rows - records - tuples - value Mary first "%" matches "M" - "a" - matches - "a" - second "%" matches "ry" - value Alan first "%" matches zero - "a" matches "A" of Alan - **sql** **case-insensitive** - second "%" matches "lan" [1]

```sql
mysql> SELECT name,age
    -> FROM person
    -> WHERE name LIKE "%a%";
+-------+------+
| name  | age  |
+-------+------+
| Mary  |   12 |
| Alan  |   12 |
| Pat   |   29 |
| Shane |   40 |
| Shane |   14 |
| Alice |   24 |
| Pat   |   37 |
+-------+------+
7 rows in set (0.00 sec)
```

- **operator** - **LIKE** - **underscore** **symbol** - \_ - **represents** a **single** **character** - returned rows - records - tuples - from columns - attributes - fields - name - age - clause - WHERE - spelling of column - attribute - field - name - has the letter - "a" - as its second character - row - record - tuple - value Mary "_" matches "M" - "a" - matches "a" - "%" matches "ry" - row - record - tuple - value Alan is not matched - "_" matches "A" - "a" does not match with "l" - "%" is never evaluated and the match fails [1]

```sql
mysql> SELECT name,age
    -> FROM person
    -> WHERE name LIKE "_a%";
+------+------+
| name | age  |
+------+------+
| Mary |   12 |
| Pat  |   29 |
| Pat  |   37 |
+------+------+
3 rows in set (0.00 sec)
```

***
# END